modules/settings/ui/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":core:ui" [fillcolor="#6b6b01"]
  ":l10n" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":settings:ui" [fillcolor="#6b6b01"]
  ":settings:vm" [fillcolor="#914141"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":core:di" [style="dashed"]
  ":core:ui" -> ":core:model" [style="bold"]
  ":core:ui" -> ":l10n" [style="dashed"]
  ":prefs" -> ":core:model" [style="bold"]
  ":settings:ui" -> ":core:model" [style="bold"]
  ":settings:ui" -> ":core:ui" [style="bold"]
  ":settings:ui" -> ":l10n" [style="dashed"]
  ":settings:ui" -> ":settings:vm" [style="bold"]
  ":settings:vm" -> ":core:di" [style="bold"]
  ":settings:vm" -> ":logging" [style="dashed"]
  ":settings:vm" -> ":prefs" [style="bold"]
}
